openFoam/dlrReactingFoam/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.233;

boundaryField
{
    combustorInlet
    {
        type            fixedValue;
        value           uniform 0.233;
    }

    combustorOutlet
    {
        type            fixedValue;
        value           uniform 0.233;
    }

    combustorWall
    {
        type            zeroGradient;
    }

    combustorFrontWall
    {
        type            zeroGradient;
    }

    combustorExitWall
    {
        type            zeroGradient;
    }

    constrictionChannel
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
