openFoam/dlrReactingFoam/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}

chemistryType
{
    chemistrySolver ode;
    chemistryThermo psi;
    TDAC            on;
}

chemistry       off;  // on;

importantSpecies
{
    CO2             ;
    H2O             ;
    O2              ;
}

initialChemicalTimeStep 1e-07;

odeCoeffs
{
    solver          seulex;
    absTol          1e-12;
    relTol          1e-07;
}

reduction
{
    active          off;//on;
    log             off;//on;
    tolerance       0.0001;
    method          DAC;
    initialSet
    {
    }
    automaticSIS    off;
    fuelSpecies
    {
        C3H8             1;
    }
}

tabulation
{
    active          off;//on;
    log             off; //on;
    printProportion off;
    printNumRetrieve off;
    tolerance       0.003;
    method          ISAT;
    scaleFactor
    {
        otherSpecies    1;
        Temperature     10000;
        Pressure        1e+15;
        deltaT          1;
    }
    maxNLeafs       5000;
    chPMaxLifeTime  1000;
    maxGrowth       100;
    checkEntireTreeInterval 500;
    maxDepthFactor  2;
    minBalanceThreshold 30;
    MRURetrieve     false;
    maxMRUSize      0;
    growPoints      true;
    maxNumNewDim    10;
}


// ************************************************************************* //
